{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 784], "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"units": 256, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense"}, "name": "dense", "class_name": "Dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout", "rate": 0.050000000000000044}, "name": "dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"units": 256, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1"}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "name": "dropout_1", "rate": 0.050000000000000044}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 10, "activation": "softmax", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_2"}, "name": "dense_2", "class_name": "Dense"}], "name": "model", "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.1.6-tf", "class_name": "Model"}